app/views/forums/index.html.erb

SELECT  "forums".* FROM "forums" ORDER BY "forums"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT("forums"."comment") FROM "forums"
SELECT COUNT("forums"."author") FROM "forums"
---
            <td><%= forum.author %></td>
            <td><%= Forum.count('comment') %></td>
            <td> <%= Forum.count('author') %> </td>