app/controllers/forums_controller.rb

  def index

  @forums = Forum.all.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "forums".* FROM "forums" ORDER BY "forums"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]

  def show
    @forum = Forum.find(params[:id])
---
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @forum = Forum.new(forum_params)
    respond_to do |f|

    if @forum.save
---
INSERT INTO "forums" ("title", "author", "subject") VALUES (?, ?, ?)  [["title", "Assignment help"], ["author", "Annoymous"], ["subject", "I need help"]]